In [1]:
import pandas as pd
import numpy as np

In [2]:
index = [('California', 2000),('California',2010),
        ('New York',2000),('New York',2010),
        ('Texas',2000),('Texas',2010)]

populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
index = pd.MultiIndex.from_tuples(index)
"""columns = ["scores"]
pop = pd.DataFrame(populations, index = index,columns=columns)
"""
pop = pd.Series(populations,index=index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [3]:
pop[('California',2010):('Texas',2000)]

California  2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
dtype: int64

In [4]:
pop[[i for i in pop.index if i[1]==2010]]

California  2010    37253956
New York    2010    19378102
Texas       2010    25145561
dtype: int64

In [5]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [6]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [7]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [8]:
pop.index.names=['state','year']

In [9]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],
                                        names = ['subject','type'])

data = np.round(np.random.randn(4,6),1)                   
data[:,::2] +=10
data +=37

health_data = pd.DataFrame(data,index=index,columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.5  35.5  48.8  37.1  47.5  37.9
     2      46.7  39.0  47.0  35.3  46.3  38.0
2014 1      46.7  37.6  47.2  37.7  46.5  37.5
     2      48.0  36.4  48.7  37.5  47.3  39.1

In [10]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      48.8  37.1
     2      47.0  35.3
2014 1      47.2  37.7
     2      48.7  37.5

In [11]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [12]:
pop['California',2000]

33871648

In [13]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [14]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [15]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [16]:
pop[pop>22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [17]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [18]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.5  35.5  48.8  37.1  47.5  37.9
     2      46.7  39.0  47.0  35.3  46.3  38.0
2014 1      46.7  37.6  47.2  37.7  46.5  37.5
     2      48.0  36.4  48.7  37.5  47.3  39.1

In [19]:
health_data['Guido','HR']

year  visit
2013  1        48.8
      2        47.0
2014  1        47.2
      2        48.7
Name: (Guido, HR), dtype: float64

In [20]:
health_data.iloc[:2,:2]

subject      Bob
type          HR  Temp
year visit
2013 1      46.5  35.5
     2      46.7  39.0

In [21]:
idx = pd.IndexSlice 
health_data.loc[idx[:,1] ,idx[:,'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      46.5  48.8  47.5
2014 1      46.7  47.2  46.5

In [22]:
index = pd.MultiIndex.from_product([['a','b','c'],[1,2]])
data = pd.Series(np.random.rand(6),index = index)
data.index.names=['char','int']
data

char  int
a     1      0.495421
      2      0.741773
b     1      0.913198
      2      0.093244
c     1      0.123395
      2      0.817178
dtype: float64

In [23]:
pop.index.names=['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [24]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [25]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [26]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [27]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [28]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [29]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      46.5  35.5  48.8  37.1  47.5  37.9
     2      46.7  39.0  47.0  35.3  46.3  38.0
2014 1      46.7  37.6  47.2  37.7  46.5  37.5
     2      48.0  36.4  48.7  37.5  47.3  39.1

In [30]:
data_mean = health_data.mean(level='year')
data_mean

subject    Bob         Guido         Sue
type        HR   Temp     HR  Temp    HR   Temp
year
2013     46.60  37.25  47.90  36.2  46.9  37.95
2014     47.35  37.00  47.95  37.6  46.9  38.30

In [31]:
data_mean.mean(axis=1, level ='type')

type         HR       Temp
year
2013  47.133333  37.133333
2014  47.400000  37.633333